{"version":"1","records":[{"hierarchy":{"lvl1":"Assignments"},"type":"lvl1","url":"/assignments","position":0},{"hierarchy":{"lvl1":"Assignments"},"content":"📝 HW1 – Due: Tue, Jan 13, 1:59 PM PT (before class)","type":"content","url":"/assignments","position":1},{"hierarchy":{"lvl1":"Assignments","lvl2":"HW1"},"type":"lvl2","url":"/assignments#hw1","position":2},{"hierarchy":{"lvl1":"Assignments","lvl2":"HW1"},"content":"Task\n\nRead Alan Turing’s “Computing Machinery and Intelligence”.\n\nRequired: Sections 1–5\n\nOptional: Remaining sections\n\nWrite a 200–350 word summary in your own words.\n\nNote: We will discuss this paper in class on Tue, Jan 13.\n\nAccessing the paper\n\nPaper link: \n\nTURING (1950)\n\nTo access the paper:\n\nGo to the link above and scroll to the Sign in section.\n\nClick Sign in through your institution.\n\nUnder Find Your Organization, enter or selectUniversity of California – San Diego (Library, OpenAthens).\n\nLog in using your UCSD account.\n\nIf you are unable to access the paper this way, a copy is also available on Canvas.\n\nOptional guiding questions\n\nYou may find the following questions helpful as you write your summary. You do not need to answer them explicitly.\n\nWhat question is Turing trying to address?\n\nWhat are the main ideas or arguments he introduces?\n\nHow does Turing propose evaluating whether a machine can think?\n\nWhat conclusions or implications does Turing suggest?\n\nGrading\n\nGraded for completion\n\nSubmission\n\nUpload a PDF of your summary to Gradescope under HW1\n\nLate policy\n\nUp to one week late accepted\n\nNote on GenAI tools\n\nFor reading-based assignments like HW1, I want to be clear about expectations and about the thoughtful use of GenAI tools (e.g., ChatGPT, Gemini, etc.)\n\nGenAI tools can easily generate a generic summary of the Turing paper. To be transparent and to avoid unnecessary duplication of effort, I’ve shared an example of such a summary below labeled GenAI Summary (Spoiler Alert).\n\nIf you are in a time crunch this week or are unable to engage deeply with the reading, you are welcome to copy that summary directly for the assignment. You will not be penalized.\n\n(Another reason for sharing the summary here is that generating AI outputs requires nontrivial computational and energy resources; we’ll talk more about this later in the course.)\n\nThat said, my expectation is that you will go beyond the summary and engage directly with the paper.\n\nFor assignments like these, the point is not the written artifact itself. The point is that you read the paper, wrestle with the ideas, and form your own understanding. The learning comes from that process, not from the final text you submit.\n\nReading the summary first is completely fine. For many people (myself included), it can be a helpful way to ease into a dense paper. What matters is that your engagement does not stop there.\n\nIf you choose to use GenAI tools, the sequence matters:\n\nYou may start with a summary if that helps you orient yourself.\n\nThen read or skim the paper itself at least once.\n\nForm your own perspective, questions, points of agreement or disagreement, and areas of confusion.\n\nUse GenAI tools afterward to clarify ideas, test your understanding, or explore alternative interpretations.\n\nMore productive uses of these tools include:\n\nAsking questions about parts of the paper you found confusing.\n\nAsking what Turing might mean by a particular claim and whether there are multiple interpretations.\n\nAsking where in the paper a specific argument is made, and then going back to read that section yourself.\n\nAsking what assumptions Turing is making or what someone might reasonably disagree with.\n\nAsking for related papers or critiques, and then reading those sources.\n\nSummaries are fine as a starting point. Engagement with the paper is what matters. My recommendation and expectation from you remains the same: read the paper, think about it, and write in your own words. That is where the value lies.\n\nGenAI Summary (SPOILER ALERT!)\n\nHere is a 200–350 word summary you can submit directly:\n\nIn “Computing Machinery and Intelligence,” Alan Turing addresses the question “Can machines think?” and argues that the question itself is too vague to be useful. Instead of trying to define “thinking,” Turing proposes a more practical test based on observable behavior, which he calls the imitation game. In this game, a human interrogator communicates through text with both a human and a machine. If the interrogator cannot reliably distinguish the machine from the human, the machine can be said to exhibit intelligence.\n\nIn the early sections of the paper, Turing explains the structure of digital computers and emphasizes that they operate by following discrete, well-defined rules. He argues that such machines are not fundamentally limited to simple calculations; in principle, they can simulate any process that can be described algorithmically. This leads to the claim that human reasoning itself may be representable as computation.\n\nTuring also anticipates and responds to several common objections to machine intelligence. These include religious arguments (that thinking requires a soul), mathematical objections based on Gödel’s incompleteness theorem, arguments from consciousness and emotion, and claims that machines can only do what they are explicitly programmed to do. Turing counters these by suggesting that human intelligence is also constrained, that learning machines could modify their behavior, and that subjective experiences are not a reliable basis for judging intelligence.\n\nOverall, Turing concludes that the question of whether machines can think should be replaced by empirical investigation: observing how machines behave as they become more sophisticated. He predicts that, over time, machines will become capable of performing well enough in the imitation game that objections to machine intelligence will seem increasingly irrelevant.\n\n📝 HW2 – Due: Tue, Jan 20, 1:59 PM PT (before class)","type":"content","url":"/assignments#hw1","position":3},{"hierarchy":{"lvl1":"Assignments","lvl2":"HW2"},"type":"lvl2","url":"/assignments#hw2","position":4},{"hierarchy":{"lvl1":"Assignments","lvl2":"HW2"},"content":"Make a copy of \n\nHW2, answer the questions, and submit your responses as a PDF under HW2 on Gradescope.\n\nBe creative! You may use an LLM to bounce ideas off of, but don’t outsource your thinking or creativity to it.\n\nEven if you completed Activity 5 as part of the in-class worksheet, please make sure to submit a copy of that to HW2 to receive credit.\n\nGrading\n\nGraded for completion\n\nSubmission\n\nUpload a PDF of your summary to Gradescope under HW2\n\nLate policy\n\nUp to one week late accepted\n\n💻 PA1 – Perceptron – Due: Tue, Feb 10, 11:59 PM PT","type":"content","url":"/assignments#hw2","position":5},{"hierarchy":{"lvl1":"Assignments","lvl2":"PA1"},"type":"lvl2","url":"/assignments#pa1","position":6},{"hierarchy":{"lvl1":"Assignments","lvl2":"PA1"},"content":"Task\n\nComplete Programming Assignment 1 (PA1).\n\nResources\n\nPA1 writeup (PDF)\n\nOpen on DataHub directly: \n\nPA1 Starter Notebook\n\nSubmission\n\nSubmit on Gradescope under PA1\n\nLate policy\n\nUp to one week late accepted\n\n💻 PA2 – Feedforward Neural Networks (FFNN) – Due: Tue, Feb 24, 11:59 PM PT","type":"content","url":"/assignments#pa1","position":7},{"hierarchy":{"lvl1":"Assignments","lvl2":"PA2"},"type":"lvl2","url":"/assignments#pa2","position":8},{"hierarchy":{"lvl1":"Assignments","lvl2":"PA2"},"content":"Task\n\nComplete Programming Assignment 2 (PA2).\n\nResources\n\nPA2 writeup (PDF)\n\nOpen on DataHub directly: \n\nPA2 Starter Notebook\nSubmission\n\nSubmit on Gradescope under PA2\n\nLate policy\n\nUp to one week late accepted\n\n💻 PA3 – N-grams – Due: Tue, Mar 3, 11:59 PM PT","type":"content","url":"/assignments#pa2","position":9},{"hierarchy":{"lvl1":"Assignments","lvl2":"PA3"},"type":"lvl2","url":"/assignments#pa3","position":10},{"hierarchy":{"lvl1":"Assignments","lvl2":"PA3"},"content":"Task\n\nComplete Programming Assignment 3 (PA3).\n\nResources\n\nPA3 writeup (PDF)\n\nOpen on DataHub directly: \n\nPA3 Folder\n\nIf the DatHub link doesn’t work: \n\nPA 3 Folder\nSubmission\n\nSubmit on Gradescope under PA3\n\nLate policy\n\nUp to one week late accepted","type":"content","url":"/assignments#pa3","position":11},{"hierarchy":{"lvl1":"Final Project"},"type":"lvl1","url":"/final-project","position":0},{"hierarchy":{"lvl1":"Final Project"},"content":"Final Project \n\nguidelines.\n\n📝 Teams Formation – Due: Thu, Feb 5, 11:59 PM PT","type":"content","url":"/final-project","position":1},{"hierarchy":{"lvl1":"Final Project","lvl2":"Teams Formation"},"type":"lvl2","url":"/final-project#teams-formation","position":2},{"hierarchy":{"lvl1":"Final Project","lvl2":"Teams Formation"},"content":"Fill in one of the following: \n\nGroup Signup Sheet or \n\nRandom Assignment Form.\n\nGroups will be finalized by Mon, Feb 9 with assigned mentor.\n\nGrading\n\n5% of Final Project Grade\n\nSubmission\n\nFill in either sheet or form by deadline.\n\nLate policy\n\nLate submissions accepted but will be penalized.\n\n📝 Project Proposal – Due: Thu, Feb 12, 11:59 PM PT","type":"content","url":"/final-project#teams-formation","position":3},{"hierarchy":{"lvl1":"Final Project","lvl2":"Project Proposal"},"type":"lvl2","url":"/final-project#project-proposal","position":4},{"hierarchy":{"lvl1":"Final Project","lvl2":"Project Proposal"},"content":"Submit a brief (<2 page) proposal describing your problem, dataset, general approach etc.\n\nSome times to address:\n\nWhat type of problem are you trying to solve? (e.g. image classification, recommender systems, etc.) Describe the problem in greater detail. Why is it interesting?\n\nWhat dataset are you using?\n\nHow will you process the data?\n\nWhat is your main model? (e.g. Convolutional Neural Networks, Tabular Q-learning, etc.)\n\nWhat evaluation metrics will you use to assess model performance?\n\nWhat baseline models will you use to evaluate performance of the main model?\n\nGrading\n\n5% of Final Project Grade\n\nSubmission\n\nGradescope by the designated deadline.\n\nGroup Submission (see directions \n\nhere).\n\nLate policy\n\nLate submissions accepted but will be penalized.\n\n💻 Example Projects Starter Code","type":"content","url":"/final-project#project-proposal","position":5},{"hierarchy":{"lvl1":"Final Project","lvl2":"Starter Code"},"type":"lvl2","url":"/final-project#starter-code","position":6},{"hierarchy":{"lvl1":"Final Project","lvl2":"Starter Code"},"content":"Attached are starter code files for the example projects given in the project guidelines. The files are meant to give you a general start on the project and generally focuses on loading and preprocessing the dataset. We recommend running your project in datahub to avoid import issues.\n\nNotes:\n\nImage Captioning project provides the generl encoder-decoder architecture. While we have provided the encoder \n\n(Resnet 50), it is your job to fill in the rest of the code.\n\nFor MSCOCO and MovieLens projects, we’ve downloaded smaller versions of the total dataset. This is primarily to prevent issues with Datahub’s storage limits and to allow for faster training. If you wish, you may download the full dataset.\n\nNote the Blackjack project uses no data and runs simualations using OpenAI’s Gymnasium enviroment.\n\nFiles:\n\nPedestrian Dection in Penn-Fudan\n\nImage Captioning in MSCOCO\n\nMovie Recommendations in MovieLens\n\nReinforcement Learning in Blackjack\n\n📝 Project Progress Report – Due: Thu, Mar 5, 11:59 PM PT","type":"content","url":"/final-project#starter-code","position":7},{"hierarchy":{"lvl1":"Final Project","lvl2":"Project Report"},"type":"lvl2","url":"/final-project#progress-report","position":8},{"hierarchy":{"lvl1":"Final Project","lvl2":"Project Report"},"content":"Submit a draft of your project report. Expectations:\n\nWell formatted with all major section headers.\n\nSections 1-3 (Intro, Data, and Model Description) mostly done.\n\nSome results (tables, figures, plots, etc.) and discussion (analysis of results).\n\nGrading\n\n10% of Final Project Grade\n\nSubmission\n\nGradescope by the designated deadline.\n\nGroup Submission (see directions \n\nhere).\n\nLate policy\n\nLate submissions accepted but will be penalized.","type":"content","url":"/final-project#progress-report","position":9},{"hierarchy":{"lvl1":"Welcome!"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Welcome!"},"content":"Welcome to the course website! This site hosts materials for UC San Diego CSE 25 – Introduction to Artificial Intelligence (Winter 2026). Here you’ll find all essential information, materials, and resources for the quarter.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Welcome!","lvl2":"About the Course"},"type":"lvl2","url":"/#about-the-course","position":2},{"hierarchy":{"lvl1":"Welcome!","lvl2":"About the Course"},"content":"This course provides a first introduction to artificial intelligence (AI).\n\nFirst day of instruction: Tuesday, January 6 at 2PM PT in \n\nCENTR 105","type":"content","url":"/#about-the-course","position":3},{"hierarchy":{"lvl1":"Welcome!","lvl2":"Getting Started"},"type":"lvl2","url":"/#getting-started","position":4},{"hierarchy":{"lvl1":"Welcome!","lvl2":"Getting Started"},"content":"We use several online platforms in this course. Please make sure you have access to all of the following.\n\nQuick Setup Checklist\n\nPlease complete the \n\nPre-Course Survey. This is required part of the course.\n\nPlease go through the \n\nSyllabus and let us know if you have any questions on Piazza.\n\nAccess \n\nPiazza – Used for course announcements and Q&A (auto-added if enrolled/waitlisted on Canvas)\n\nAccess \n\nGradescope (auto-added if enrolled/waitlisted on Canvas)\n\nAccess \n\nDataHub (auto-added if enrolled/waitlisted on Canvas)\n\nSign up for \n\nWebclicker using your UCSD email. The course registration code is BJWNLK.\n\nEnroll in PrairieLearn: \n\nEnrollment Link\n\nEnroll in PrairieTest for in-person assessments: \n\nEnrollment Link\n\nSchedule your \n\nTests as soon as possible (opens first day of instruction).\n\nThe \n\nSchedule page lists weekly class activities, readings, deadlines, and assessments.\n\nFind office hour times and access info on the \n\nOffice Hours page.\n\nMeet your instructional team on the \n\nCourse Staff page.\n\n💬 Course Communication\n\nPlease use Piazza for all course-related discussions. Email may be missed, so Piazza is the best way to ensure timely responses - it is catered to getting you help fast and efficiently from classmates, the TAs, and the instructor. If you need to discuss something privately, you may post a private message to the instructors.\n\nWelcome to Our Learning Community!\n\nWe’re all on this learning journey together. Supporting each other and staying engaged will help us create a positive and productive environment for everyone. Let’s make this an enjoyable quarter!\n\nI look forward to seeing you in class!","type":"content","url":"/#getting-started","position":5},{"hierarchy":{"lvl1":"Office Hours"},"type":"lvl1","url":"/office-hours","position":0},{"hierarchy":{"lvl1":"Office Hours"},"content":"Office hours are a drop-in (in person or remote or hybrid) Question & Answer opportunity to talk with the tutors, TAs, and instructor about concepts and specific questions from class and homework. Check the title of the calendar event to see whether the office hour is in-person-only, remote-only, or hybrid.\n\nNote: The calendar doesn’t display on some browsers. If you don’t see the calendar above, please refresh the window or try another browser.","type":"content","url":"/office-hours","position":1},{"hierarchy":{"lvl1":"Research"},"type":"lvl1","url":"/research","position":0},{"hierarchy":{"lvl1":"Research"},"content":"","type":"content","url":"/research","position":1},{"hierarchy":{"lvl1":"Research","lvl2":"Study Overview"},"type":"lvl2","url":"/research#study-overview","position":2},{"hierarchy":{"lvl1":"Research","lvl2":"Study Overview"},"content":"The instructor of this course, Dr. Trevor Bonjour (UC San Diego), is conducting a research study. The purpose of this study is to understand how students experience an introductory AI course that uses a neural-networks-first approach. The study examines:\n\nPerceptions of course difficulty, pacing, and workload\n\nConfidence in learning AI concepts\n\nHow prior coding and mathematics experience relate to engagement and learning","type":"content","url":"/research#study-overview","position":3},{"hierarchy":{"lvl1":"Research","lvl2":"Required Course Activities vs. Research Use of Data"},"type":"lvl2","url":"/research#required-course-activities-vs-research-use-of-data","position":4},{"hierarchy":{"lvl1":"Research","lvl2":"Required Course Activities vs. Research Use of Data"},"content":"The surveys are required as part of the course. However, using this data for research is optional.\n\nCompleting surveys is required for the course\n\nAllowing your data to be used for research is voluntary\n\nIf you opt out at any time, your data will not be used for research purposes\n\nOpting out does not affect your grade, standing, or access to course resources","type":"content","url":"/research#required-course-activities-vs-research-use-of-data","position":5},{"hierarchy":{"lvl1":"Research","lvl2":"What Participation May Involve"},"type":"lvl2","url":"/research#what-participation-may-involve","position":6},{"hierarchy":{"lvl1":"Research","lvl2":"What Participation May Involve"},"content":"If you allow your data to be used for research, this may include:\n\nPre-course survey (5–10 minutes)\n\nWeekly “one-minute-paper” surveys\n\nPost-course survey (5–10 minutes)\n\nOptional interview: You may be invited to participate in a short, optional interview after completing the course. This interview will focus on your learning experience, perceptions, and reflections on the neural-networks-first approach used in the Introduction to Artificial Intelligence course. These interviews allow for more in-depth discussions and will allow students to share their experiences and perspectives in greater detail. With your permission, the interview will be audio recorded for transcription and analysis purposes.\n\nParticipation lasts approximately the length of the course.","type":"content","url":"/research#what-participation-may-involve","position":7},{"hierarchy":{"lvl1":"Research","lvl2":"Eligibility"},"type":"lvl2","url":"/research#eligibility","position":8},{"hierarchy":{"lvl1":"Research","lvl2":"Eligibility"},"content":"This research includes only participants who are 18 years of age or older\n\nIf you are under 18, your data will automatically not be used for research\n\nNo action is required if you are under 18","type":"content","url":"/research#eligibility","position":9},{"hierarchy":{"lvl1":"Research","lvl2":"Voluntary Participation and Opting Out"},"type":"lvl2","url":"/research#voluntary-participation-and-opting-out","position":10},{"hierarchy":{"lvl1":"Research","lvl2":"Voluntary Participation and Opting Out"},"content":"Research participation is voluntary\n\nYou may opt out at any time during the quarter\n\nYou may skip any question\n\nIf you opt out, all past and future course data will be excluded from the research dataset","type":"content","url":"/research#voluntary-participation-and-opting-out","position":11},{"hierarchy":{"lvl1":"Research","lvl2":"Privacy and Confidentiality"},"type":"lvl2","url":"/research#privacy-and-confidentiality","position":12},{"hierarchy":{"lvl1":"Research","lvl2":"Privacy and Confidentiality"},"content":"To protect your privacy:\n\nYour responses will be anonymized using a unique participant ID.\n\nAny audio recordings will be stored securely on encrypted servers and accessed only by authorized research team members.\n\nYour responses will be shared only in de-identified, aggregated form (e.g., summary statistics) and will not contain any personally identifying information.\n\nThe de-identified data may be retained indefinitely and used for future research.","type":"content","url":"/research#privacy-and-confidentiality","position":13},{"hierarchy":{"lvl1":"Research","lvl2":"How to Opt Out"},"type":"lvl2","url":"/research#how-to-opt-out","position":14},{"hierarchy":{"lvl1":"Research","lvl2":"How to Opt Out"},"content":"If you do not want your survey data used for research, complete the opt-out form below.\n\nOpt-Out Form Link","type":"content","url":"/research#how-to-opt-out","position":15},{"hierarchy":{"lvl1":"Research","lvl2":"Questions"},"type":"lvl2","url":"/research#questions","position":16},{"hierarchy":{"lvl1":"Research","lvl2":"Questions"},"content":"If you have questions about this study or your rights as a participant, please contact Trevor Bonjour: \n\ntbonjour@ucsd.edu.","type":"content","url":"/research#questions","position":17},{"hierarchy":{"lvl1":"Schedule"},"type":"lvl1","url":"/schedule","position":0},{"hierarchy":{"lvl1":"Schedule"},"content":" **Assessment Overview**\n\n| Assessment Type | Due When |\n|-----------------|----------|\n| Homework Assignments | Will be posted |\n| 2 Tests           | Weeks 4 & 8 |\n| 1 Final Project | Finals Week|  \n:::{admonition}🗓️ Typical Week  \n:class: note\n:icon: false\n- Lectures on `Tuesdays` and `Thursdays 2PM - 3:20PM`, at \n- A TA discussion session by `Thursday` for weeks when a homework is released.\n::: \n\n🖥️ Schedule Your \n\nTests.\n\nTest 1 will be in Week 4, Test 2 will be in Week 8\n\nOptional Make-up tests in Week 10 \n:::{admonition} ⚠️ Tentative Schedule\n:class: note\n:icon: false\nTopics and exact pacing are **tentative** and may shift as the quarter progresses.\n::: ","type":"content","url":"/schedule","position":1},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 1"},"type":"lvl2","url":"/schedule#week-1","position":2},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 1"},"content":" *Week of Jan 5* \n\n📖 In-Class: Tue, Jan 6\n\nWorksheet\n\nWorksheet 1\n\nIn-Class Activities\n\nPerceptions of AIIndividual reflection and small-group discussion.\n\nReading and ReflectionRead this \n\narticle and respond to guided questions.\n\nClass Discussion: ResponsibilityWhole-class discussion on responsibility and accountability in AI.\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 1 Tuesday\n\n📖 In-Class: Thu, Jan 8\n\nWorksheet\n\nWorksheet 2\n\nIn-Class Activities\n\nWhat Makes Something Intelligent?\n\nGroup Activity: Small-group discussion using a \n\nshared board.\n\nBig Ideas in AI\n\nShort discussion on perception, representation, learning, interaction, and societal impact.\n\nWorksheet activity applying the Big Ideas to:\n\nFace detection on phones\n\nA biological intelligence example\n\nAnother AI system\n\nResources: \n\nBig Ideas Poster\n\nAreas where AI is Used\n\nShort discussion on major AI application areas (e.g., vision, language, recommendation systems, robotics).\n\nWorksheet Activity: Connecting AI areas to CSE courses.\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 1 Thursday\n\n📝 \n\nHW1 – Due: Tue, Jan 13, 1:59 PM PT (before class)\n\nHW1","type":"content","url":"/schedule#week-1","position":3},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 2"},"type":"lvl2","url":"/schedule#week-2","position":4},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 2"},"content":" *Week of Jan 12* \n\n💬 Discussion: Mon, Jan 12\n\nOverview\n\nWe’ll go over DataHub and a Python review.\n\nOpen on DataHub directly: \n\nPython Review Notebook.\n\n📖 In-Class: Tue, Jan 13\n\nWorksheet\n\nWorksheet 3\n\nIn-Class Activities\n\nThe Imitation Game (Turing, Sections 1–5)Individual reflection followed by small-group discussion on what the Imitation Game captures about intelligence and what it leaves unresolved.\n\nLearning Machines (Turing, Section 7)\n\n Jigsaw-style group activity. We will read and teach each other different parts of Turing’s discussion on child machines, rewards and punishments, and learning with opacity and randomness. \n\nRead and discuss different parts of Turing’s argument about learning machines, then explain your section to your group.\n\nEngineered vs. Learned IntelligenceWork in small groups to classify AI systems as engineered or learned and justify your reasoning.\n\nWhat Is Required for Learned Intelligence\nReflect individually on what a system needs in order to learn, then contribute your ideas to a shared class list.\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 2 Tuesday\n\n📖 In-Class: Thu, Jan 15\n\nWorksheet\n\nWorksheet 4\n\nIn-Class Activities\n\nEngineered vs. Learned IntelligenceWork in small groups to classify AI systems as engineered or learned and justify your reasoning.\n\nWhat Is Required for Learned Intelligence\nReflect individually on what a system needs in order to learn, then contribute your ideas to a shared class list.\n\nMachine Learning Pipeline\nBuild a high-level machine learning pipeline, discuss the role of each stage, and reason about why learning systems are iterative.\n\nLearning Paradigms\nIdentify whether example systems use supervised, unsupervised, or reinforcement learning and explain why.\n\nDesigning a Learning System\nIndividually propose a learning system by defining the problem, the type of data or experience needed, the learning paradigm, and what success would look like. (PLEASE SUBMIT THIS AS HW2)\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 2 Thursday\n\n📋 \n\nWeek 2 Reflection – Due: Sun, Jan 18, 11:59 PM PT\n\nPlease complete the weekly reflection survey by Sunday - It should only take a minute.\n\n📝 \n\nHW2 – Due: Tue, Jan 20, 1:59 PM PT (before class)\n\nHW2","type":"content","url":"/schedule#week-2","position":5},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 3"},"type":"lvl2","url":"/schedule#week-3","position":6},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 3"},"content":"📖 In-Class: Tue, Jan 20\n\nLog in to \n\nDataHub using your UCSD account. Then click on the worksheet link below - it should directly open the worksheet in DataHub.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 5\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\n📖 In-Class: Thu, Jan 22\n\n🖥️ Schedule Your \n\nTests.\n\nTest 1 is next week - Week 4. Please schedule your \n\nTests if you haven’t already done so.\n\nQuick Poll\n\nPlease complete this short poll at the start of class:\n\n\nPoll Link\n\nIn today’s class we will:\n\nContinue reviewing Worksheet 5 and finish the final exercise.\n\nReview the material we have covered so far.\n\nAddress any specific topics you would like to revisit and work through a few sample questions together.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 5\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nFilled Worksheet\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 3 Thursday\n\nTo receive credit, your submission must include an attempted solution for Exercise: Brute-Force Search for Celsius to Fahrenheit.\n\nTest 1 Prep:\n\nPlease review the \n\nTest 1 preparation notes and let us know if you have any questions or clarifications.\n\nWe will work thruogh the \n\nPractice Set 1 on prairielearn.\n\n📋 \n\nWeek 3 Reflection – Due: Sun, Jan 25, 11:59 PM PT\n\nPlease complete the weekly reflection survey by Sunday - It should only take a minute.","type":"content","url":"/schedule#week-3","position":7},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 4"},"type":"lvl2","url":"/schedule#week-4","position":8},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 4"},"content":" *Week of Jan 26* \n\n💬 Discussion: Mon, Jan 26\n\nOverview\n\nWalkthrough of the final project - logistics, expectations, example projects\n\nDiscussion Slides\n\nOpen on DataHub directly: \n\nDiscussion 2 Notebook: More Python programming practice, covering lists, dictionaries, numpy, and matplotlib. Not required for submission.\n\nFinal Project \n\nguidelines Python Programming: Lists, dicts, classes, numpy, matplotlib \n\n📖 In-Class: Tue, Jan 27\n\nLog in to \n\nDataHub using your UCSD account. Then click on the worksheet link below - it should directly open the worksheet in DataHub.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 6\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nFilled Worksheet\n\nSubmission\n\nUpload a PDF of the (partially) completed worksheet 6 to Gradescope under In-Class – Week 4 Tuesday\n\n📖 In-Class: Thu, Jan 29\n\nLog in to \n\nDataHub using your UCSD account. Then click on the worksheet link below - it should directly open the worksheet in DataHub.\n\nWe will finish working on Worksheet 6 and then continue onto Worksheet 7.\nYou can use your worksheet 6 from last time or if you want you can also use the filled one (from last class) linked below.\n\nWorksheet\n\nFilled Worksheet 6( from Tuesday)\n\nOpen on DataHub directly: \n\nWorksheet 7\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed worksheet 6 to Gradescope under In-Class – Week 4 Thursday\n\nTo receive credit, your submission must include an attempted solution for Exercise: Implement Gradient Descent and Exercise: Compute Gradients for Both Weight and Bias.\n\n📋 \n\nWeek 4 Reflection – Due: Sun, Feb 01, 11:59 PM PT\n\nPlease complete the weekly reflection survey by Sunday - It should only take a minute.","type":"content","url":"/schedule#week-4","position":9},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 5"},"type":"lvl2","url":"/schedule#week-5","position":10},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 5"},"content":" *Week of Feb 2* \n\n💬 Discussion: Mon, Feb 2\n\nOverview\n\nOpen on DataHub directly: \n\nDiscussion 3 Notebook. Not required for submission.\n\n💻 \n\nPA1 - Perceptron – Due: Tue, Feb 10, 11:59 PM PT\n\nPA1\n\n📖 In-Class: Tue, Feb 3\n\nReminders\n\nFinal Project - \n\nTeams Formation is due by this Thursday - It counts for 5% of the project grade.\n\nPA1 is released and is due by next Tuesday.\n\nWeekly reflections are due by Sunday - these count towards your participation grade.\n\nIn-Class Acitivity\n\nWe will finish working on Worksheet 7.\n\nLog in to \n\nDataHub using your UCSD account. Then click on the worksheet link below - it should directly open the worksheet in DataHub.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 7\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed worksheet 7 to Gradescope under In-Class – Week 5 Tuesday\n\nSupplementary Worksheet\n\nOpen on DataHub directly: \n\nWorksheet 7 - Supplementary\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nNo submission required for the Supplementary Worksheet. :::{admonition} Side Quest\n:icon: false\n:open: false\n:class: tip\n\n[Side Quest 1](https://docs.google.com/presentation/d/1g1uaurl-GckLb47FskBPzgtsrQJPiAQUhdVML_eOI_8/edit?usp=sharing)\n\n::: \n\n📖 In-Class: Thu, Feb 5\n\nReminders\n\nPA1 is due by next Tuesday.\n\nFinal Project - \n\nTeams Formation is due today.\n\nWeekly reflections are due by Sunday and count toward your participation grade. Will be released after thursday’s class.\n\nIn-Class Activity\n\nToday, we will work through Worksheet 8, where we focus on how models learn by reducing loss. You will:\n\n- Examine the forward computation from inputs to loss\n- Use loss functions to evaluate predictions\n- Estimate gradients using finite differences\n- Discuss why this approach is computationally expensive \n\nLog in to \n\nDataHub using your UCSD account.Then click the worksheet link below to open it directly in DataHub.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 8\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 5 Thursday.\n\n📋 \n\nWeek 5 Reflection – Due: Sun, Feb 08, 11:59 PM PT\n\nPlease complete the weekly reflection survey by Sunday - It should only take a minute.","type":"content","url":"/schedule#week-5","position":11},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 6"},"type":"lvl2","url":"/schedule#week-6","position":12},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 6"},"content":"💻 \n\nPA2 - Feedfoward Neural Networks (FFNN) – Due: Tue, Feb 24, 11:59 PM PT\n\nPA2\n\n📖 In-Class: Tue, Feb 10\n\nReminders\n\nPA1 is due today.\n\nFinal Project - Project proposal is due this Thursday.\n\nWeekly reflections are due by Sunday and count toward your participation grade. Will be released after thursday’s class.\n\nIn-Class Activity\n\nToday, we will work through Worksheet 9.\n\nLog in to \n\nDataHub using your UCSD account.Then click the worksheet link below to open it directly in DataHub.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 9\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 6 Tuesday.\n\n📖 In-Class: Thu, Feb 12\n\nReminders\n\nFinal Project - Project proposal is due today.\n\nWeekly reflections are due by Sunday and count toward your participation grade. Will be released after thursday’s class.\n\nIn-Class Activity\n\nToday, we will work through Worksheet 10. Use the main Notebook Environment.\n\nLog in to \n\nDataHub using your UCSD account.Then click the worksheet link below to open it directly in DataHub.\n\nWorksheet\n\nOpen on DataHub directly: \n\nWorksheet 10\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed worksheet to Gradescope under In-Class – Week 6 Thursday.\n\n📋 \n\nWeek 6 Reflection – Due: Sun, Feb 15, 11:59 PM PT\n\nPlease complete the weekly reflection survey by Sunday - It should only take a minute.","type":"content","url":"/schedule#week-6","position":13},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 7"},"type":"lvl2","url":"/schedule#week-7","position":14},{"hierarchy":{"lvl1":"Schedule","lvl2":"Week 7"},"content":"Test 2 is next week!\n\n📖 In-Class: Tue, Feb 17\n\nIn-Class Activity\n\nToday, we will finish working on Worksheet 10 and then work through Worksheet 11.\n\nLog in to \n\nDataHub using your UCSD account.Then click the worksheet link below to open it directly in DataHub.\n\nWorksheet 10\n\nOpen on DataHub directly: \n\nWorksheet 10\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nWorksheet 11\n\nOpen on DataHub directly: \n\nWorksheet 11\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed Worksheet 10 to Gradescope under In-Class – Week 7 Tuesday\n\nTo receive credit, your submission must include an attempted solution for: Exercise: Update the _backward() functions for add, mul, and sigmoid_func in the next cell so they correctly propagate gradients using the chain rule.\n\n📖 In-Class: Thu, Feb 18\n\nReminders\n\nTest 2 is next week - Week 8. Please schedule your \n\nTests if you haven’t already done so. It covers all material from Week 4 to Week 7.\n\nPA 2 is due next Tuesday. Please start early!\n\nProject Proposal feedback should be out soon - please review the feedback and talk to your assigned mentor if needed.\n\nWeekly reflections are due by Sunday and count toward your participation grade. Will be released after thursday’s class.\n\nIn-Class Activity\n\nToday, we will finish working on Worksheet 11 and then work through some practice problems for Test 2 if we have time.\n\nLog in to \n\nDataHub using your UCSD account.Then click the worksheet link below to open it directly in DataHub.\n\nWorksheet 11\n\nOpen on DataHub directly: \n\nWorksheet 11\n\nIf the DataHub link does not work, \n\ndownload the notebook from GitHub and upload it to DataHub.\n\nSubmission\n\nUpload a PDF of the completed Worksheet 11 to Gradescope under In-Class – Week 7 Thursday\n\nTest 1 Prep:\n\nPlease review the \n\nTest 2 preparation notes and let us know if you have any questions or clarifications.\n\nWe will work thruogh the \n\nPractice Set 2 on prairielearn.\n\n📋 \n\nWeek 7 Reflection – Due: Sun, Feb 22, 11:59 PM PT\n\nPlease complete the weekly reflection survey by Sunday - It should only take a minute.","type":"content","url":"/schedule#week-7","position":15},{"hierarchy":{"lvl1":"Course Staff"},"type":"lvl1","url":"/staff","position":0},{"hierarchy":{"lvl1":"Course Staff"},"content":"","type":"content","url":"/staff","position":1},{"hierarchy":{"lvl1":"Course Staff","lvl2":"Instructor"},"type":"lvl2","url":"/staff#instructor","position":2},{"hierarchy":{"lvl1":"Course Staff","lvl2":"Instructor"},"content":"Trevor Bonjour (He/Him) Short description here: who you are, what do you like doing when not working, etc.  \n\ntbonjour@ucsd.edu, Office: CSE 2114","type":"content","url":"/staff#instructor","position":3},{"hierarchy":{"lvl1":"Course Staff","lvl2":"Teaching Assistants"},"type":"lvl2","url":"/staff#teaching-assistants","position":4},{"hierarchy":{"lvl1":"Course Staff","lvl2":"Teaching Assistants"},"content":"Eric Jialong Song Short description here: who you are, what do you like doing when not working, etc.  \n\nejsong@ucsd.edu\n\nShreyas Kadekodi Short description here: who you are, what do you like doing when not working, etc.  \n\nskadekodi@ucsd.edu","type":"content","url":"/staff#teaching-assistants","position":5},{"hierarchy":{"lvl1":"Course Staff","lvl2":"Tutors"},"type":"lvl2","url":"/staff#tutors","position":6},{"hierarchy":{"lvl1":"Course Staff","lvl2":"Tutors"},"content":"Sarah Chun Short description here: who you are, what do you like doing when not working, etc.  \n\ns7chun@ucsd.edu\n\nLulu Shao Short description here: who you are, what do you like doing when not working, etc.  \n\nsishao@ucsd.edu","type":"content","url":"/staff#tutors","position":7},{"hierarchy":{"lvl1":"Syllabus"},"type":"lvl1","url":"/syllabus","position":0},{"hierarchy":{"lvl1":"Syllabus"},"content":"","type":"content","url":"/syllabus","position":1},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Course Overview"},"type":"lvl2","url":"/syllabus#course-overview","position":2},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Course Overview"},"content":"","type":"content","url":"/syllabus#course-overview","position":3},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Course Description","lvl2":"Course Overview"},"type":"lvl3","url":"/syllabus#course-description","position":4},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Course Description","lvl2":"Course Overview"},"content":"This course provides a first introduction to artificial intelligence (AI). It covers the definition of AI, the history of AI, the main approaches to AI, and example applications of AI and machine learning (ML). Concepts will be grounded in a range of real-world application projects in AI. Students will also be introduced to ethical issues around AI.","type":"content","url":"/syllabus#course-description","position":5},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Prerequisites","lvl2":"Course Overview"},"type":"lvl3","url":"/syllabus#prerequisites","position":6},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Prerequisites","lvl2":"Course Overview"},"content":"COGS 18 or CSE 11 or CSE 6R or CSE 8A or CSE 8B or DSC 20. This course is intended for students with no prior AI or ML experience.","type":"content","url":"/syllabus#prerequisites","position":7},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Learning Outcomes","lvl2":"Course Overview"},"type":"lvl3","url":"/syllabus#learning-outcomes","position":8},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Learning Outcomes","lvl2":"Course Overview"},"content":"Upon successful completion of this course, students will be able to:\n\nExplain what artificial intelligence is and articulate the core ideas underlying modern AI systems.\n\nDescribe the end-to-end AI pipeline, from problem formulation and data to modeling, training, evaluation, and deployment.\n\nDistinguish between major learning paradigms, including supervised learning, unsupervised learning, and reinforcement learning.\n\nApply programming tools to interact with and evaluate AI models.\n\nEvaluate the societal and ethical implications of real-world AI applications.","type":"content","url":"/syllabus#learning-outcomes","position":9},{"hierarchy":{"lvl1":"Syllabus","lvl2":"How to Succeed in This Class"},"type":"lvl2","url":"/syllabus#how-to-succeed-in-this-class","position":10},{"hierarchy":{"lvl1":"Syllabus","lvl2":"How to Succeed in This Class"},"content":"Keep up with course activities: New ideas often build on earlier material. Staying engaged with lectures, discussions, in-class activities, readings, and course work will help you connect concepts and build understanding over time.\n\nBe consistent: Regular review and steady work each week will help you avoid last-minute stress and make learning more manageable.\n\nCollaborate: I encourage you to talk to your peers, form study groups, and discuss course material to deepen your understanding. Feel free to use Search for Teammates on Piazza to find a study group.\n\nAttend office hours: Office hours are a great way to get help with course content, ask questions, and connect with the course staff. We have an amazing instructional staff who are eager to help!\n\nFocus on learning over grades: The goal of this course is to build understanding, not just to earn points. Outsourcing your work to a friend, the internet, or an AI tool to replace your own thinking may seem like it’s helping in the short term, but it prevents you from developing the skills this course is designed to teach.\n\nThis course is designed to be approachable while still engaging with core AI concepts and ideas. We provide extensive support through office hours and Piazza. Use these resources and you will be well positioned to succeed.","type":"content","url":"/syllabus#how-to-succeed-in-this-class","position":11},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Course Information"},"type":"lvl2","url":"/syllabus#course-information","position":12},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Course Information"},"content":"Instructor:\n\n\nTrevor Bonjour (he/him), \n\ntbonjour@ucsd.edu\n\nPlease see \n\nCourse Staff to learn more about the instructional team.","type":"content","url":"/syllabus#course-information","position":13},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Lectures","lvl2":"Course Information"},"type":"lvl3","url":"/syllabus#lectures","position":14},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Lectures","lvl2":"Course Information"},"content":"Lectures are on\nTuesdays and Thursdays, 2PM - 3:20PM, at \n\nCENTR 105\n\nLectures will be held in-person at the regularly-scheduled time and place. Attendance is highly encouraged, but NOT required. Lectures are designed to include in-class activities, discussion, and collaborative work, and students who attend in person will get the most out of these experiences. Lecture notes and other materials will be posted, and lectures will be podcasted and posted online for remote viewing.\n\nPlease note, we have requested that podcasting be enabled for the lectures, but we cannot guarantee that it will always work. You will be able to find the lecture recordings at \n\npodcast.ucsd.edu.","type":"content","url":"/syllabus#lectures","position":15},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Discussions","lvl2":"Course Information"},"type":"lvl3","url":"/syllabus#discussions","position":16},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Discussions","lvl2":"Course Information"},"content":"Discussion sections will be held on Mondays, 12:00–12:50 PM in CENTR 212, except during the first week of the quarter and on university holidays. Each discussion will be led by a TA and is designed to support your learning, with a focus on programming, assignments, and working through examples related to the course material. Attendance is encouraged but not required.","type":"content","url":"/syllabus#discussions","position":17},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Office Hours","lvl2":"Course Information"},"type":"lvl3","url":"/syllabus#office-hours","position":18},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Office Hours","lvl2":"Course Information"},"content":"Office hours are a drop-in (in person or remote) Question & Answer opportunity to talk with the tutors, TAs, and instructor about concepts and specific questions from class and homework. We offer multiple sessions each week. Please check the \n\noffice-hours page for the schedule.","type":"content","url":"/syllabus#office-hours","position":19},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Textbook and Materials","lvl2":"Course Information"},"type":"lvl3","url":"/syllabus#textbook-and-materials","position":20},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Textbook and Materials","lvl2":"Course Information"},"content":" There are no **required** textbook for this course.  \n\nYou will not need to purchase any materials for this course. All required materials will be provided through the course website. These may include notes, examples, Python notebooks, short readings, references, and occasional videos.\n\nThe course does not closely follow a particular text. Nevertheless, the following texts (though not required) may be useful as general references. All of these are freely available.\n\nArtificial Intelligence: Foundations of Computational Agents (Poole & Mackworth, 2023)\n\nMastering Reinforcement Learning (Tim Miller, 2023) ## Course Schedule\n\nThe course schedule is posted in [](schedule.md). ","type":"content","url":"/syllabus#textbook-and-materials","position":21},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Assessments"},"type":"lvl2","url":"/syllabus#assessments","position":22},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Assessments"},"content":"This course includes a mix of in-class activities, reflection surveys, homework assignments, two in-person tests and one group project.","type":"content","url":"/syllabus#assessments","position":23},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Participation","lvl2":"Assessments"},"type":"lvl3","url":"/syllabus#participation","position":24},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Participation","lvl2":"Assessments"},"content":"There are two components for participation in the course: in-class activities and weekly reflection surveys. Participation is designed to support engagement and learning. All participation is graded for completion, not correctness.","type":"content","url":"/syllabus#participation","position":25},{"hierarchy":{"lvl1":"Syllabus","lvl4":"In-class Participation","lvl3":"Participation","lvl2":"Assessments"},"type":"lvl4","url":"/syllabus#in-class-participation","position":26},{"hierarchy":{"lvl1":"Syllabus","lvl4":"In-class Participation","lvl3":"Participation","lvl2":"Assessments"},"content":"In-class participation credit may be earned through a variety of in-class activities, which can include worksheets, polling questions, discussion prompts, brief coding or analysis tasks.\n\nStudents who are unable to attend a class session may earn participation credit by completing the in-class activity outside of class by 11:59 PM on the Sunday following the lecture. Please note, this deadline is the same for all lectures in a given week, regardless of whether the lecture was on Tuesday or Thursday.\n\nCompletion means submitting a reasonable attempt that addresses the prompts for the activity. While participation can be completed outside of class, many activities are designed for live interaction and are most valuable when done in person.","type":"content","url":"/syllabus#in-class-participation","position":27},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Reflection Surveys","lvl3":"Participation","lvl2":"Assessments"},"type":"lvl4","url":"/syllabus#reflection-surveys","position":28},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Reflection Surveys","lvl3":"Participation","lvl2":"Assessments"},"content":"Students are required to complete:\n\nOne pre-course survey (Week 1)\n\n8 weekly reflection surveys (Week 2 to Week 9)\n\nOne post-course survey (Finals Week)\n\nWeekly reflection surveys are due by Sunday at 11:59 PM and are an important part of the course. These reflections help you track your learning, and they help the instructional team understand what is working and what needs adjustment.","type":"content","url":"/syllabus#reflection-surveys","position":29},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Homework Assignments","lvl2":"Assessments"},"type":"lvl3","url":"/syllabus#homework-assignments","position":30},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Homework Assignments","lvl2":"Assessments"},"content":"There will be several homework assignments throughout the quarter. These assignments may include written and programming components and are designed to help you explore, build, and reason about AI systems using concepts from the course. Assignments may involve implementing, modifying, or evaluating models, as well as analyzing results.\n\nAssignment instructions will specify the submission format, deadlines, any grace periods, the regrade policy, and allowed resources.","type":"content","url":"/syllabus#homework-assignments","position":31},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Final Project","lvl2":"Assessments"},"type":"lvl3","url":"/syllabus#final-project","position":32},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Final Project","lvl2":"Assessments"},"content":"There will be an open-ended group project that serves as the final for the class. Students will work in teams to explore an AI problem or application using ideas from the course. The project is due during the official final exam window. See final project section for more details.","type":"content","url":"/syllabus#final-project","position":33},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Tests","lvl2":"Assessments"},"type":"lvl3","url":"/syllabus#tests","position":34},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Tests","lvl2":"Assessments"},"content":"There will be two 45-minute, in-person, self-scheduled tests.\n\nTest 1 will be in Week 4 and covers all material through Week 3.\n\nTest 2 will be in Week 8 and covers all material through Week 7.","type":"content","url":"/syllabus#tests","position":35},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Make-up Tests","lvl3":"Tests","lvl2":"Assessments"},"type":"lvl4","url":"/syllabus#make-up-tests","position":36},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Make-up Tests","lvl3":"Tests","lvl2":"Assessments"},"content":"If needed, you may schedule make-up tests for Test 1, Test 2, or both in Week 10. Each make-up test corresponds to one of the original tests. For each test, if your make-up test score is higher than your original score, it will replace that score. If your make-up score is lower, your original score will be kept. Taking make-up tests is optional.\n\nUnder this policy, a poor performance on an earlier test can be erased by stronger performance on the corresponding make-up test, without risk of lowering your grade.\n\nExample: If you scored 60% on Test 1 and 90% on Test 2, and later earn 85% on the Test 1 make-up and 88% on the Test 2 make-up, your final test scores would be 85% (Test 1) and 90% (Test 2).\n\nFrom TTC:\n\nRegistration for make-up tests will open approximately one week before the beginning of the make-up testing window. Once the registration window opens for the make-ups, if students have trouble finding a spot, they can email us at \n\ntritontesting@ucsd​.edu.","type":"content","url":"/syllabus#make-up-tests","position":37},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Scheduling the Tests","lvl3":"Tests","lvl2":"Assessments"},"type":"lvl4","url":"/syllabus#scheduling-the-tests","position":38},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Scheduling the Tests","lvl3":"Tests","lvl2":"Assessments"},"content":"Tests for this course will be administered by the Triton Testing Center (TTC) in the Computer-Based Testing Facility in AP&M B349 and B432. The TTC’s rules concerning testing are the rules for this course.\n\nYou must schedule your tests in advance, and it is recommended that you do so as soon as possible. Scheduling for all tests opens on the first day of instruction.\n\nTo make sure you have access to the test questions, you need to be enrolled in PrairieLearn course instance. Please use the \n\nprairielearn enrollment link.\n\nTo schedule the test, first make sure you self-enroll on prairietest. Please use the \n\nprairietest enrollment link. Once you have self-enrolled in prairietest, follow the \n\nregistration instructions at TTC-AP&M to schedule your test.","type":"content","url":"/syllabus#scheduling-the-tests","position":39},{"hierarchy":{"lvl1":"Syllabus","lvl5":"Students with OSD approved Accommodations","lvl4":"Scheduling the Tests","lvl3":"Tests","lvl2":"Assessments"},"type":"lvl5","url":"/syllabus#students-with-osd-approved-accommodations","position":40},{"hierarchy":{"lvl1":"Syllabus","lvl5":"Students with OSD approved Accommodations","lvl4":"Scheduling the Tests","lvl3":"Tests","lvl2":"Assessments"},"content":"If you will be utilizing accommodations for your test, you will take it at the TTC’s Pepper Canyon Hall location. You must schedule your test at least three days in advance through the \n\nRegisterBlast system. RegisterBlast scheduling is to be done ONLY by students with OSD-approved accommodations. Tests scheduled via RegisterBlast without accommodations will be cancelled.\n\nYou can also find information about scheduling your test on \n\nTTC’s website. Here is more information about \n\ntesting policies and procedures and \n\nFAQs. You may also email \n\ntritontesting@ucsd​.edu for assistance.","type":"content","url":"/syllabus#students-with-osd-approved-accommodations","position":41},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Grading"},"type":"lvl2","url":"/syllabus#grading","position":42},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Grading"},"content":"We will use the following grade breakdown:\n\nAssessment\n\nPercentage\n\nHomework Assignments\n\n35%\n\nTest 1\n\n15%\n\nTest 2\n\n15%\n\nIn-Class Participation\n\n10%\n\nReflections\n\n5%\n\nFinal Project\n\n20%","type":"content","url":"/syllabus#grading","position":43},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Grading Scale","lvl2":"Grading"},"type":"lvl3","url":"/syllabus#grading-scale","position":44},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Grading Scale","lvl2":"Grading"},"content":"The standard grading scale below is the starting point for the course. After all scores are in, final letter-grade cutoffs may be adjusted slightly downward if appropriate, but cutoffs will never be raised. For example, the A cutoff will never exceed 94%.\n\nLetter Grade\n\nRange\n\nA\n\n≥ 94%\n\nA-\n\n≥ 90% < 94%\n\nB+\n\n≥ 87% < 90%\n\nB\n\n≥ 84% < 87%\n\nB-\n\n≥ 80% < 84%\n\nC+\n\n≥ 77% < 80%\n\nC\n\n≥ 74% < 77%\n\nC-\n\n≥ 70% < 74%\n\nD\n\n≥ 61% < 70%\n\nF\n\n< 61%\n\nPass/Not Pass for Undergraduate Students: We will follow the university grading system of C- or higher for P/NP grades.\n\nIncomplete Grade: Sometimes, circumstances beyond a student’s control prevent them from completing a class even once they have completed the majority of the coursework at a passing level. UCSD has a process in place for you to request an Incomplete (I) if this happens to you. Here is the \n\ncampus policy about the Incomplete grade and some \n\ninformation about it.","type":"content","url":"/syllabus#grading-scale","position":45},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Course Policies"},"type":"lvl2","url":"/syllabus#course-policies","position":46},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Course Policies"},"content":"","type":"content","url":"/syllabus#course-policies","position":47},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Accommodations for Students with Disabilities","lvl2":"Course Policies"},"type":"lvl3","url":"/syllabus#accommodations-for-students-with-disabilities","position":48},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Accommodations for Students with Disabilities","lvl2":"Course Policies"},"content":"We aim to create an environment in which all students can succeed in this course. We need and want to hear from you if additional accommodations would improve your experience in the course.\n\nIf you have a disability, please contact the Office for Students with Disability (OSD), which is located in University Center 202 behind Center Hall, to discuss appropriate accommodations right away. They also provide the \n\nOSD Student Portal. We will work to provide you with the accommodations you need, but you must first provide a current Authorization for Accommodation (AFA) letter issued by the OSD. You are required to present the AFA letters to the Faculty and to the OSD Liaison in the department in advance so that accommodations may be arranged. We ask that you work to organize the AFA and to let us know about it as early in the quarter as possible so that we can best support your needs. For more information, see \n\nDisability Resources at UCSD.","type":"content","url":"/syllabus#accommodations-for-students-with-disabilities","position":49},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Academic Integrity","lvl2":"Course Policies"},"type":"lvl3","url":"/syllabus#academic-integrity","position":50},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Academic Integrity","lvl2":"Course Policies"},"content":"In this course we expect students to adhere to the \n\nUC San Diego Integrity of Scholarship Policy. This means that you will complete your work honestly, and with integrity, and support an environment of integrity within the class.\n\nSome examples of specific ways this policy applies to CSE 25 include:\n\nCollaboration and use of AI tools is allowed during homework assignments and projects, but all writeups and code must reflect your own work (or your group’s work if group work is allowed).\n\nStudents may not post any problems or solutions from any homework or exam to any repository or website.\n\nNo unauthorized aids may be used during tests.\n\nStudents may not submit responses to in-class polls when not physically present in class.","type":"content","url":"/syllabus#academic-integrity","position":51},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Use of Gen AI Tools","lvl3":"Academic Integrity","lvl2":"Course Policies"},"type":"lvl4","url":"/syllabus#use-of-gen-ai-tools","position":52},{"hierarchy":{"lvl1":"Syllabus","lvl4":"Use of Gen AI Tools","lvl3":"Academic Integrity","lvl2":"Course Policies"},"content":"You may use AI tools (e.g., ChatGPT, Copilot, etc.) for learning support, debugging, or exploring ideas, but not to replace your own thinking. Any submitted work should reflect your understanding, and you should be able to explain it if asked. Submitting AI-generated work without meaningful modification, attribution, or understanding is not permitted.","type":"content","url":"/syllabus#use-of-gen-ai-tools","position":53},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Missed Test Policy","lvl2":"Course Policies"},"type":"lvl3","url":"/syllabus#missed-test-policy","position":54},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Missed Test Policy","lvl2":"Course Policies"},"content":"Tests must be taken during their designated testing windows in Week 4 and Week 8. Week 10 make-up tests are the only built-in make-up option. Outside of these testing windows, no additional make-ups will be offered. If you have a serious illness or an emergency, please contact the instructor as soon as possible.","type":"content","url":"/syllabus#missed-test-policy","position":55},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Outside Tutoring","lvl2":"Course Policies"},"type":"lvl3","url":"/syllabus#outside-tutoring","position":56},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Outside Tutoring","lvl2":"Course Policies"},"content":"Individuals are not permitted to approach students to offer services of any kind in exchange for pay, including tutoring services. This is considered a solicitation for business and is strictly prohibited by University policy.","type":"content","url":"/syllabus#outside-tutoring","position":57},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Class material and intellectual property","lvl2":"Course Policies"},"type":"lvl3","url":"/syllabus#class-material-and-intellectual-property","position":58},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Class material and intellectual property","lvl2":"Course Policies"},"content":"Our lectures and course materials, including videos, assignments, and similar materials, are protected by U.S. copyright law and by University policy. We are the exclusive owner of the copyright in those materials we create. We acknowledge the cumulative contributions to this course material of previous instructors, TAs, and tutors, as well as contributions to the class structure from colleagues in CSE and at UCSD.\n\nYou may take notes and make copies of course materials for your own use. You may also share those materials with another student who is enrolled in or auditing this course. You may not reproduce, distribute or display (post/upload) lecture notes or recordings or course materials in any other way — whether or not a fee is charged — without our express prior written consent. You also may not allow others to do so. If you do so, you may be subject to student conduct proceedings under the UC San Diego Student Code of Conduct.\n\nSimilarly, you own the copyright in your original work. If I am interested in posting your answers or papers on the course web site, I will ask for your written permission.","type":"content","url":"/syllabus#class-material-and-intellectual-property","position":59},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Late Adds","lvl2":"Course Policies"},"type":"lvl3","url":"/syllabus#late-adds","position":60},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Late Adds","lvl2":"Course Policies"},"content":"I follow the CSE department guidance on Late Adds, namely that “all students are expected to attend class for the first two weeks and complete assignments if they are on the waitlist for a course. Attending class and completing course assignments does not guarantee enrollment. If students choose to miss class or not turn in assignments while on the waitlist, the student will receive a “0” on all missed assignments, if they secure a seat in the course off the waitlist.”","type":"content","url":"/syllabus#late-adds","position":61},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Exceptions and Flexibility"},"type":"lvl2","url":"/syllabus#exceptions-and-flexibility","position":62},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Exceptions and Flexibility"},"content":"The policies in this syllabus are meant to be clear and fair, but we recognize that life does not always follow a perfect schedule. In general, our policies serve three purposes:\n\nSupport learning. Deadlines, test structures, and regrade windows help you keep pace with the material and give you timely feedback.\n\nProvide built-in flexibility. Grace periods and make-up options are there so that an occasional conflict or busy week does not derail your progress.\n\nKeep the course manageable. With hundreds of students, consistent rules and firm deadlines allow us to grade promptly and provide the level of support you expect.\n\nThese policies are designed to handle most of the everyday disruptions of a quarter so you do not need to request one-off exceptions for routine issues.","type":"content","url":"/syllabus#exceptions-and-flexibility","position":63},{"hierarchy":{"lvl1":"Syllabus","lvl3":"When to reach out","lvl2":"Exceptions and Flexibility"},"type":"lvl3","url":"/syllabus#when-to-reach-out","position":64},{"hierarchy":{"lvl1":"Syllabus","lvl3":"When to reach out","lvl2":"Exceptions and Flexibility"},"content":"Some situations go beyond these built-in allowances. Please contact the instructor as soon as possible if you experience a serious illness, hospitalization, family emergency, accident, or other significant event that prevents you from meeting course requirements. We will work with you to find an appropriate solution.","type":"content","url":"/syllabus#when-to-reach-out","position":65},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Resources for Students"},"type":"lvl2","url":"/syllabus#resources-for-students","position":66},{"hierarchy":{"lvl1":"Syllabus","lvl2":"Resources for Students"},"content":"","type":"content","url":"/syllabus#resources-for-students","position":67},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Mental Health Services","lvl2":"Resources for Students"},"type":"lvl3","url":"/syllabus#mental-health-services","position":68},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Mental Health Services","lvl2":"Resources for Students"},"content":"For students seeking services for mental health issues (including, but not limited to: stress, sleep issues, depression, anxiety, academic distress, relationship issues, etc.), Counseling and Psychological Services (CAPS) provides free, confidential psychological counseling and crisis services for all registered UC San Diego students. CAPS also provides a variety of groups, workshops and drop-in forums.\n\nTo contact CAPS, call (858) 534-3755. All students are screened with a brief telephone assessment. For more information, visit the \n\nCounseling and Psychological Services website.","type":"content","url":"/syllabus#mental-health-services","position":69},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Getting Help","lvl2":"Resources for Students"},"type":"lvl3","url":"/syllabus#getting-help","position":70},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Getting Help","lvl2":"Resources for Students"},"content":"We expect that all students will need help at some point during the quarter. Many resources are available including TA and instructor office hours, as well as the Piazza discussion board. We also encourage you to form study groups.\n\nThe IDEA Engineering Student Center, located just off the lobby of Jacobs Hall, is a hub for student engagement, academic enrichment, personal/professional development, leadership, community involvement, and a respectful learning environment for all. The Center offers a variety of programs, listed on the IDEA Center Facebook page at \n\nhttp://​www​.facebook​.com​/ucsdidea (you are welcome to Like this page!) and the Center website at \n\nhttp://​idea​.ucsd​.edu/. The IDEA Center programs support both undergraduate students and graduate students.” The \n\nTeaching and Learning Commons continues to offer their full suite of student success programs, including learning strategies coaching.","type":"content","url":"/syllabus#getting-help","position":71},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Diversity and Inclusion","lvl2":"Resources for Students"},"type":"lvl3","url":"/syllabus#diversity-and-inclusion","position":72},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Diversity and Inclusion","lvl2":"Resources for Students"},"content":"We are committed to fostering a learning environment for this course that supports a diversity of thoughts, perspectives, and experiences, and respects your identities (including race, ethnicity, heritage, gender, sex, class, sexuality, religion, ability, age, educational background, etc.). Our goal is to create a diverse and inclusive learning environment where all students feel comfortable and can thrive.\n\nOur instructional staff will make a concerted effort to be welcoming and inclusive to the wide diversity of students in this course. If there is a way we can make you feel more included please let one of the course staff know, either in person, via email/discussion board, or even in a note under the door. Our learning about diverse perspectives and identities is an ongoing process, and we welcome your perspectives and input.\n\nWe also expect that you, as a student in this course, will honor and respect your classmates, abiding by the UCSD Principles of Community (\n\nhttps://​ucsd​.edu​/about​/principles​.html), along with the guidelines for online interaction posted on the site. Please understand that others’ backgrounds, perspectives, and experiences may be different than your own, and help us to build an environment where everyone is respected and feels comfortable.\n\nIf you experience any sort of harassment or discrimination, please contact the instructor as soon as possible. If you prefer to speak with someone outside of the course, please contact the Office of Prevention of Harassment and Discrimination: \n\nhttps://​ophd​.ucsd​.edu/.","type":"content","url":"/syllabus#diversity-and-inclusion","position":73},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Basic Needs/Food Insecurities","lvl2":"Resources for Students"},"type":"lvl3","url":"/syllabus#basic-needs-food-insecurities","position":74},{"hierarchy":{"lvl1":"Syllabus","lvl3":"Basic Needs/Food Insecurities","lvl2":"Resources for Students"},"content":"If you are experiencing any basic needs insecurities (food, housing, financial resources), there are resources available on campus to help, including The Hub and the Triton Food Pantry. Please visit \n\nhttp://​thehub​.ucsd​.edu/ for more information.","type":"content","url":"/syllabus#basic-needs-food-insecurities","position":75},{"hierarchy":{"lvl1":"Syllabus","lvl2":"FAQs"},"type":"lvl2","url":"/syllabus#faqs","position":76},{"hierarchy":{"lvl1":"Syllabus","lvl2":"FAQs"},"content":"Is this class curved?\n\nSort of. We start with the standard grading scale (A ≥ 94%, A- ≥ 90%, etc.). After all scores are in, final cutoffs may be adjusted slightly downward if appropriate, but cutoffs will never be raised, so the A threshold will never exceed 94%.\n\nCan I take the tests remotely or schedule my test in another week?\n\nTests are in person at the Triton Testing Center. The self-scheduled tests already provide flexibility. Anything beyond this would require significant extra work for staff and is not allowed. Instead, the optional make-up tests in Week 10 serves as a built-in backup: if you miss or underperform on an earlier test, the make-up can replace your lower score.\n\nWhat if I’m mildly sick and can’t submit homework on time?\n\nMinor illnesses are common. The optional make-up tests, and make-up participations, grace periods are designed to absorb routine disruptions without individual exceptions. For serious illness or an extended medical issue, contact the instructor and provide documentation so we can coordinate accommodations.\n\nI’m close to the next grade up. Can you round my final grade or give extra credit work?\n\nNo. Grades are determined by the published policies for everyone. Offering extra work or rounding for individuals would be unfair and would create grading overload for the staff.\nWe also can’t offer special opportunities (such as extra work) to raise an individual grade. To be fair, any extra assignment would need to be offered to everyone, and even a percentage of takers would create more grading than the staff can handle at the end of the quarter. Instead, second chances are built into the course through the make-up test and other policies, which give all students the same opportunity to demonstrate mastery.","type":"content","url":"/syllabus#faqs","position":77}]}